# NewDWFXExportOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewDWFXExportOptions Method
Application Class See Also
---
Creates DWFX Export options.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DWFXExportOptions NewDWFXExportOptions()
```

Visual Basic
---
```text
Public Function NewDWFXExportOptions As DWFXExportOptions
```

Visual C++
---
```text
public:
DWFXExportOptions^ NewDWFXExportOptions()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace